#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Себестоимость.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл   
		// регистр ТоварыНаСкладах Приход
		
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Организация = Организация;
		Движение.Количество = ТекСтрокаТовары.Количество;   
		
		// регистр Себестоимость Приход
		Движение = Движения.Себестоимость.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Организация = Организация;
		Движение.Партия = Ссылка;
		Движение.КомисионныйТовар = Договор.ВидДоговора = Перечисления.ВидыЗакупки.Комиссия;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	
	
КонецПроцедуры
#КонецОбласти
